genestealer/everblu-meters-esp8266-improved/src/main.cpp
    saveFrequencyOffset(offset);
    
    char freqBuffer[16];
    snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", offset * 1000.0);  // Convert MHz to kHz
    mqtt.publish("everblu/cyble/frequency_offset", freqBuffer, true);
    
    char statusMsg[128];
    snprintf(statusMsg, sizeof(statusMsg), "Initial scan complete: offset %.3f kHz", offset * 1000.0);
    mqtt.publish("everblu/cyble/status_message", statusMsg, true);
    
    cc1101_init(bestFreq);
  } else {
    Serial.println("> Wide scan failed - no meter signal found!");
    Serial.println("> Please check:");
    Serial.println(">  1. Meter is within range (< 50m typically)");
    Serial.println(">  2. Antenna is connected to CC1101");
    Serial.println(">  3. Meter serial/year are correct in private.h");
    Serial.println(">  4. Current time is within meter's wake hours");
    mqtt.publish("everblu/cyble/status_message", "Initial scan failed - check setup", true);
    cc1101_init(baseFreq);
  }
  
  mqtt.publish("everblu/cyble/cc1101_state", "Idle", true);
}

// Function: adaptiveFrequencyTracking
// Description: Uses FREQEST register to adaptively adjust frequency offset over time
//              Accumulates frequency error estimates and adjusts when threshold is reached
void adaptiveFrequencyTracking(int8_t freqest) {
  // FREQEST is a two's complement value representing frequency offset
  // Resolution is approximately Fxosc/2^14 ≈ 1.59 kHz per LSB (for 26 MHz crystal)
  const float FREQEST_TO_MHZ = 0.001587; // Conversion factor: ~1.59 kHz per LSB
  
  // Accumulate the frequency error
  float freqErrorMHz = (float)freqest * FREQEST_TO_MHZ;
  cumulativeFreqError += freqErrorMHz;
  successfulReadsBeforeAdapt++;
  
  Serial.printf("> FREQEST: %d (%.4f kHz error), cumulative: %.4f kHz over %d reads\n", 
                freqest, freqErrorMHz * 1000, cumulativeFreqError * 1000, successfulReadsBeforeAdapt);
  
  // Only adapt after N successful reads to avoid over-correcting on noise
  if (successfulReadsBeforeAdapt >= ADAPT_THRESHOLD) {
    float avgError = cumulativeFreqError / ADAPT_THRESHOLD;
    
    // Only adjust if average error is significant (> 2 kHz)
    if (abs(avgError * 1000) > 2.0) {
      Serial.printf("> Adaptive adjustment: average error %.4f kHz over %d reads\n", 
                    avgError * 1000, ADAPT_THRESHOLD);
      
      // Adjust the stored offset (apply 50% of the measured error to avoid over-correction)
      float adjustment = avgError * 0.5;
      storedFrequencyOffset += adjustment;
      
      Serial.printf("> Adjusting frequency offset by %.6f MHz (new offset: %.6f MHz)\n", 
                    adjustment, storedFrequencyOffset);
      
      saveFrequencyOffset(storedFrequencyOffset);
      
      char freqBuffer[16];
      snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", storedFrequencyOffset * 1000.0);  // Convert MHz to kHz
      mqtt.publish("everblu/cyble/frequency_offset", freqBuffer, true);
      
      // Reinitialize CC1101 with adjusted frequency
      cc1101_init(FREQUENCY + storedFrequencyOffset);
    } else {
      Serial.printf("> Frequency stable (avg error %.4f kHz < 2 kHz threshold)\n", avgError * 1000);
    }
    
    // Reset accumulators
    cumulativeFreqError = 0.0;
    successfulReadsBeforeAdapt = 0;
  }
}


// Function: validateConfiguration
// Description: Validates configuration parameters at startup to fail fast on invalid settings
bool validateConfiguration() {
  bool valid = true;
  
  Serial.println("\n=== Configuration Validation ===");
  
  // Validate METER_YEAR (should be 0-99 for years 2000-2099)
  if (METER_YEAR > 99) {
    Serial.printf("ERROR: Invalid METER_YEAR=%d (expected 0-99)\n", METER_YEAR);
    valid = false;
  } else {
    Serial.printf("✓ METER_YEAR: %d (20%02d)\n", METER_YEAR, METER_YEAR);
  }
  
  // Validate METER_SERIAL (should not be 0)
  if (METER_SERIAL == 0) {
    Serial.println("ERROR: METER_SERIAL not configured (value is 0)");
    Serial.println("       Update METER_SERIAL in private.h with your meter's serial number");
    valid = false;
  } else {
    Serial.printf("✓ METER_SERIAL: %lu\n", (unsigned long)METER_SERIAL);
  }
  
  // Validate FREQUENCY if defined (should be 300-500 MHz for 433 MHz band)
  #ifdef FREQUENCY
  if (FREQUENCY < 300.0 || FREQUENCY > 500.0) {
    Serial.printf("ERROR: Invalid FREQUENCY=%.2f MHz (expected 300-500 MHz)\n", FREQUENCY);
    valid = false;
  } else {
    Serial.printf("✓ FREQUENCY: %.6f MHz\n", FREQUENCY);
  }
  #else
  Serial.println("✓ FREQUENCY: Using default 433.82 MHz (RADIAN protocol)");
  #endif
  
  // Validate GDO0 pin (basic check - should be defined)
  #ifdef GDO0
  Serial.printf("✓ GDO0 Pin: GPIO %d\n", GDO0);
  #else
  Serial.println("ERROR: GDO0 pin not defined in private.h");
  valid = false;
  #endif
  
  // Validate reading schedule
  if (!isValidReadingSchedule(readingSchedule)) {
    Serial.printf("ERROR: Invalid reading schedule '%s'\n", readingSchedule);
    Serial.println("       Expected: 'Monday-Friday', 'Monday-Saturday', or 'Monday-Sunday'");
    valid = false;
  } else {
    Serial.printf("✓ Reading Schedule: %s\n", readingSchedule);
  }
  
  Serial.println("================================\n");
  
  return valid;
}

// Function: setup
// Description: Initializes the device, including serial communication, Wi-Fi, MQTT, and CC1101 radio with automatic calibration.
void setup()
{
  Serial.begin(115200);
  Serial.println("\n");
  Serial.println("Everblu Meters ESP8266/ESP32 Starting...");
  Serial.println("Water usage data for Home Assistant");
  Serial.println("https://github.com/genestealer/everblu-meters-esp8266-improved");
  Serial.printf("Target meter: 20%02d-%07lu\n\n", METER_YEAR, (unsigned long)METER_SERIAL);

  // Validate configuration before proceeding
  if (!validateConfiguration()) {
    Serial.println("\n*** FATAL: Configuration validation failed! ***");
    Serial.println("*** Fix the errors in private.h and reflash ***");
    Serial.println("*** Device halted - will not continue ***\n");
    while(1) {
      digitalWrite(LED_BUILTIN, LOW);  // Blink LED to indicate error
      delay(200);
      digitalWrite(LED_BUILTIN, HIGH);
      delay(200);
    }
  }
  
  Serial.println("✓ Configuration valid - proceeding with initialization\n");

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW); // turned on to start with

  // Initialize persistent storage
#if defined(ESP8266)
  EEPROM.begin(EEPROM_SIZE);
  Serial.println("> EEPROM initialized");
  
  // Clear EEPROM if requested (set CLEAR_EEPROM_ON_BOOT=1 in private.h)
  // Use this when replacing ESP board, CC1101 module, or moving to a different meter
  #if CLEAR_EEPROM_ON_BOOT
    Serial.println("> CLEARING EEPROM (CLEAR_EEPROM_ON_BOOT = 1)...");
    for (int i = 0; i < EEPROM_SIZE; i++) {
      EEPROM.write(i, 0xFF);
    }
    EEPROM.commit();
    Serial.println("> EEPROM cleared. Remember to set CLEAR_EEPROM_ON_BOOT = 0 after testing!");
  #endif
#endif

